{"meta":{"title":"OpenSource Bookcase","subtitle":"My journey to full stack","description":"I am willing to learn and distribute in opensource project. I believe sofeware can make better world. I am vim user.","author":"Sam Wang","url":"https://bookcaseballpen.github.io"},"pages":[{"title":"","date":"2016-09-16T16:39:18.191Z","updated":"2016-09-16T16:39:18.191Z","comments":false,"path":"tags/index.html","permalink":"https://bookcaseballpen.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"My second post","slug":"My-second-post","date":"2016-09-17T05:41:29.000Z","updated":"2016-09-17T05:41:29.699Z","comments":true,"path":"2016/09/17/My-second-post/","link":"","permalink":"https://bookcaseballpen.github.io/2016/09/17/My-second-post/","excerpt":"","text":"","categories":[],"tags":[],"keywords":[]},{"title":"How to use hexo to host your blog on github (On Linux Mint 17.3 Rosa)","slug":"My-first-post","date":"2016-09-16T16:18:27.000Z","updated":"2016-09-17T08:32:16.465Z","comments":true,"path":"2016/09/17/My-first-post/","link":"","permalink":"https://bookcaseballpen.github.io/2016/09/17/My-first-post/","excerpt":"","text":"Long time ago, I intented to create my own static blog on github. I tried jekyll and octopress at beginning of this year. Hoever it just not the feel of blog. It kind of short simplicity. I am not against to use ruby. As a Front end developer now, I used ruby quite alot for sass and compass. I also used leanote and wiznote for personal blog building. Still I feels there is something not correct. Unti I find vimWiki, I realized the language for bloging is not convenient for me. As a programmer, I prefer to note down my thoughts as fast as possible. Markdown with TOC seems is perfect for me. Then I recorded jekyll also support markdown. After the second time of investigation in jekyll, I found out jekyll is not convenient for markdown indexing and generating TOC. I know They can be archieve by installing generators. In the time of search around, hexo falls into my eyes. It&#x2019;s combination of all functions I am looking for, And it&#x2019;s build on Nodejs, this is a plus point for me. =) tl:dr Install HexoHow to installfollow the user guild, the installation of Hexo is very standard NodeJs installation. make sure your have NodeJs installed first.1$ npm install -g hexo Init your projectcreate a new folder and inside the folder, init the hexo project.1hexo init See your blogstart your hexo server, you can see your hexo is runing on localhost:4000 1hexo server Your first post1hexo new &quot;your title&quot; Now your blog is up to running. How simple it is. ~o~ Setup ThemeNow is time to beautify your blog. I will not list down the common markdown syntex You can browser through the hexo themes. I need a theme has better navigation, tags system and also support internal search. I found this theme indigo suits all my needs. Clone your themeCopy the theme into your themes1$ git clone https://github.com/yscoder/hexo-theme-indigo /themes/indigo/ Shift to new themeYou only need to modify the &#x2018;_config.yml&#x2019; to enable the new theme1theme: indigo Install all necessary plugsTo enable the theme default functions, style, feed rss, json content and sidenavigator, you need to install following plugins.12$ npm install --save hexo-renderer-less hexo-generator-feedhexo-generator-json-content hexo-toc Enable tagsCreate a page tag and modify it to enable the them tags.1hexo new page tags Modify the create tags page, replace the content as below.1234layout: tagsnoDate: truecomments: false--- Now you have your first nice theme. Because this theme is created by a chineseauthor, you might need to change system chinese instructions. It wont take youtoo much time compare to create your own theme. You can also find your ownprefered theme on hexo website. The installation takes the same steps. Deploy to githubThe Deployment in hexo is so simple to do. You only need to specify the deploy inyour _config.yml, then you are ready to go. I prefer to host my blog on my Setup deploymentgithub account.123456&lt;_config.yml&gt;Deploy: type: git repor: your repo url // you can choose ssh or http repo url branch: master // you can choose to publish to your gh page if you have more then one blog on your github account. Deploy1$ hexo generate &amp;&amp; hexo deploy You will be asked to key in username and password if you choose to use http repo url. MscThere are few functions I added to my blog. Some of them took me few time tofigure it out how they works. List them down here, hope can save your time. Enable Disqus Comment promptthe disqus short name is not your username or display name. It&#x2019;s the name inyour url right before the &#x2018;disqus.com&#x2019;, this one really confused me for aawhile.12&lt;themes/indigo/_config.yml&gt;disqus_shortname: your_disques_shortname Hope this post can help your, I will update this on the way of using it. Leaveyour comments if you need any assistant.","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"https://bookcaseballpen.github.io/tags/hexo/"},{"name":"github","slug":"github","permalink":"https://bookcaseballpen.github.io/tags/github/"},{"name":"blog","slug":"blog","permalink":"https://bookcaseballpen.github.io/tags/blog/"},{"name":"markdown","slug":"markdown","permalink":"https://bookcaseballpen.github.io/tags/markdown/"}],"keywords":[]},{"title":"Hello World","slug":"hello-world","date":"2016-09-16T16:14:29.259Z","updated":"2016-09-16T16:14:29.259Z","comments":true,"path":"2016/09/17/hello-world/","link":"","permalink":"https://bookcaseballpen.github.io/2016/09/17/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[],"keywords":[]}]}